tap "epk/epk"
tap "homebrew/bundle"
tap "iina/mpv-iina"
brew "bat"
brew "python@3.12"
brew "cocoapods"
brew "dav1d"
brew "difftastic"
brew "eza"
brew "fd"
brew "fish"
brew "fisher"
brew "fontforge"
brew "frei0r"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "gnutls"
brew "swift-protobuf"
brew "grpc-swift"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "libsoxr"
brew "libvidstab"
brew "little-cms2"
brew "luajit"
brew "meson"
brew "mujs"
brew "neovim"
brew "node"
brew "pkg-config"
brew "pngquant"
brew "rubberband"
brew "rustup-init"
brew "snappy"
brew "speex"
brew "starship"
brew "swift-format"
brew "swiftgen"
brew "swiftlint"
brew "uchardet"
brew "webp"
brew "zeromq"
brew "zimg"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
cask "arc"
cask "copilot-for-xcode"
cask "feishu"
cask "figma"
cask "font-sf-mono-nerd-font"
cask "github"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "notion"
cask "raycast"
cask "sf-symbols"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "zerotier-one"
vscode "aaron-bond.better-comments"
vscode "bmalehorn.vscode-fish"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "ionutvmi.path-autocomplete"
vscode "janisdd.vscode-edit-csv"
vscode "jeusto.warm-up-typing-test"
vscode "leetcode.vscode-leetcode"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mitaki28.vscode-clang"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "nickdemayo.vscode-json-editor"
vscode "oliversturm.fix-json"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "psioniq.psi-header"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tboby.cwtools-vscode"
vscode "tboby.paradox-syntax"
vscode "twxs.cmake"
vscode "uctakeoff.vscode-counter"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vknabel.vscode-apple-swift-format"
vscode "vknabel.vscode-swiftlint"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "wscats.eno"
vscode "yzhang.markdown-all-in-one"
