tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "nikitabobko/tap"
tap "olets/tap"
tap "playcover/playcover"
brew "mas"
brew "swiftgen"
brew "xcbeautify"
brew "xcode-build-server"
brew "zsh-completions"
brew "olets/tap/zsh-abbr"
brew "olets/tap/zsh-autosuggestions-abbreviations-strategy"
cask "aerospace"
cask "arc"
cask "figma"
cask "firefox"
cask "gitbutler"
cask "github"
cask "github-copilot-for-xcode"
cask "iina"
cask "playcover-community"
cask "sf-symbols"
cask "wezterm"
mas "Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Raycast Companion", id: 6738274497
mas "SnippetsLab", id: 1006087419
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Twitter", id: 1482454543
mas "Wallpaper Play", id: 1638457121
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
