tap "epk/epk"
tap "homebrew/bundle"
tap "iina/mpv-iina"
tap "playcover/playcover"
brew "little-cms2"
brew "webp"
brew "atuin"
brew "bat"
brew "python@3.12"
brew "cmake"
brew "cmake-docs"
brew "cocoapods"
brew "dav1d"
brew "difftastic"
brew "eza"
brew "fastlane"
brew "fd"
brew "frei0r"
brew "gnutls"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "libsoxr"
brew "libvidstab"
brew "rubberband"
brew "snappy"
brew "speex"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fontforge"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "swift-protobuf"
brew "grpc-swift"
brew "luajit"
brew "mas"
brew "meson"
brew "mujs"
brew "neovim"
brew "node"
brew "nushell"
brew "pandoc"
brew "pipx"
brew "pkgconf"
brew "pngquant"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "swift-format"
brew "swiftgen"
brew "swiftlint"
brew "uchardet"
brew "xcbeautify"
brew "xcode-build-server"
brew "zoxide"
brew "zsh-autocomplete", args: ["HEAD"]
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-syntax-highlighting"
cask "android-platform-tools"
cask "arc"
cask "copilot-for-xcode"
cask "feishu"
cask "figma"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-sf-mono-nerd-font"
cask "github"
cask "github-copilot-for-xcode"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "jordanbaird-ice"
cask "kitty"
cask "notion"
cask "playcover-community"
cask "raycast"
cask "sf-symbols"
cask "visual-studio-code"
cask "warp"
cask "wezterm@nightly"
cask "zed"
cask "zerotier-one"
mas "Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Twitter", id: 1482454543
mas "Wallpaper Play", id: 1638457121
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "bmalehorn.vscode-fish"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "ginfuru.vscode-jekyll-snippets"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "grapecity.gc-excelviewer"
vscode "ionutvmi.path-autocomplete"
vscode "janisdd.vscode-edit-csv"
vscode "jeusto.warm-up-typing-test"
vscode "leetcode.vscode-leetcode"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mitaki28.vscode-clang"
vscode "ms-cst-e.vscode-devskim"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "nickdemayo.vscode-json-editor"
vscode "oliversturm.fix-json"
vscode "openai.openai-chatgpt-adhoc"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "psioniq.psi-header"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rreverser.llvm"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sissel.shopify-liquid"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tboby.cwtools-vscode"
vscode "tboby.paradox-syntax"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "twxs.cmake"
vscode "uctakeoff.vscode-counter"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vknabel.vscode-swiftformat"
vscode "vknabel.vscode-swiftlint"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "wscats.eno"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
